from utils.date_helper import get_first_week_date

HOST = "0.0.0.0"
PORT = 8000

FIRST_WEEK_DATE = get_first_week_date()
SAMPLE_PROFESSORS = [
    "Гедранович Валентина Васильевна",
    "Дашук Элина Владимировна",
    "Зеневич Анна Михайловна",
    "Змеева Юлия Викторовна",
    "Ковалёв Александр Петрович",
    "Кравчук Александр Степанович",
    "Лубашева Татьяна Владимировна",
    "Мироненко Виктор Анатольевич",
    "Пунчик Зоя Владимировна",
    "Пунчик Николай Николаевич",
    "Седун Андрей Максимович",
    "Серебряная Лия Валентиновна",
    "Гулина Ольга Валериевна",
    "Черепица Любовь Сергеевна",
    "Генрихсен Светлана Николаевна",
    "Забродская Кристина Адамовна",
    "Майоровская Светлана Владимировна",
    "Прыгун Ирина Владимировна",
    "Аксень Эрнест Маврициевич",
    "Михальков Максим Дмитриевич",
    "Остапенко Анатолий Владимирович",
    "Сосновский Олег Анатольевич",
    "Новиков Василий Алексеевич",
    "Кунцевич Ольга Юрьевна"
]

UPDATE_PERIOD = 300
